[
  {
    "id": "1730184853376",
    "content": "**The overlooked sector of the economy**\n\nWorking at big techs was the dream of a lot of people, including me. But after the pandemic and layoffs, it made me think again. \n\nLiving in London gave me a perspective on \"owning a postcode\" as opposed to the scale that big techs are going after. You can monopolise an expensive streets cleaning and maintenance and make a fortune out of it, the extreme version of the 20/80 rule.\n\nWith that in mind, those are usually the overlooked sector of the economy, such as real estate. Finding these overlooked gaps would be more important than ever now.\n\nInspiration: [Reflections on Palantir](https://nabeelqu.co/reflections-on-palantir)",
    "timestamp": "2024-10-29T06:54:13.376Z"
  },
  {
    "id": "1730111794428",
    "content": "**The calendar monopoly**\n\nI was trying to setup a calendar that logs all the economic events into a google calendar. However after some quick research, there are actually very few places where you can access it.\n\nThis also makes me wonder, the calendar that most of the world uses actually shapes our everyday life. It governs our way of life more so than anything else. Things got more expensive as well as cheaper because of that and people travel across the world because of that too.\n\nIt reminded me of the disciplined life of a children who study at school. While we growth up we thought we had some freedom, we are just actually governed by yet another calendar.\n\nWhat's the way around it? Well, you can create your own calendar!",
    "timestamp": "2024-10-28T10:36:34.428Z"
  },
  {
    "id": "1730016964690",
    "content": "**Use hardware to upsell software**\n\nI bought a new Macbook Air recently, and I found this \"Service Included With Purchase\" in my settings app on my iPad, which is the bundle you got for every new apple devices that you bought.\n\nI paused for a moment and thought, what company on earth can sell ads in the settings app? That might be just Apple. I remember back in the days Xiaomi MIUI also started to place adds into settings app but got a lot of backlash. It is Apple that has the brand value plus cross selling the services that are of the same brand that made people tolerated it.\n\nNow you might ask did this strategy worked? Here is what I found from perplexity: Services revenue grew from 46 billion in 2019 to 85.2 billion in 2023, representing an 85% increase over four years.\n\nApparently it's not just that but I guess it worked.\n\n",
    "timestamp": "2024-10-27T08:16:04.690Z"
  },
  {
    "id": "1729929071152",
    "content": "**Appreciation based networking**\n\nI got a cold LinkedIn message from a uni graduate, which asked me for advice. I actually don't have any, but I do cold message message people on LinkedIn as well, and here is what I learned so far.\n\n- Treat it like a message in a bottle floating in the sea, you don't expect to hear back\n- Don't ask for a meeting, thank them in advance for reading and responding. The best is thank for their article published online, their talk online, their book. That is of course that you have read it and you are truly appreciated of their work, be specific of your appreciation\n- Only ask them out if you have a clear thing to discuss about them, not about you\n\nSo here are the rule of thumb on how I cold message. The next question is how to covert, but that is another level of networking, let's see how it unfolds.",
    "timestamp": "2024-10-26T07:51:11.152Z"
  },
  {
    "id": "1729857916765",
    "content": "**Why do you travel anyway?**\n\nI was next to a cab driver that is driving us back to the Naxos town centre from a restaurant, and he told me this that I remembered deeply. \n\n\"Morris\", he had a deep voice, \"Why do you think people travel?\" I looked at him and not sure what to say. \n\n\"They want memories and pictures.\"\n\nSo the moral of the story is don't hesitate next time when you want to take that picture, the future you will thank you for that.",
    "timestamp": "2024-10-25T12:05:16.765Z"
  },
  {
    "id": "1729760886327",
    "content": "**Owning the letter K**\n\nWhat do you think of when you see the letter K? Korea wants you to think of Korea. \n\nI came across the YouTube channel Netflix K Content that covers everything that is Korean related on Netflix. All content that starts with K goes to Korea, that quite a strategy of owning a letter of a foreign language.",
    "timestamp": "2024-10-24T09:08:06.327Z"
  },
  {
    "id": "1729611090427",
    "content": "**The VIP experience of software**\n\nThe strong case of software is that the marginal cost of a new copy of the same experience is near zero. On the other hand, a VIP experience is that it is a unique experience, and it is also the VIP experience that allows one to charge at a premium because VIP experience is expensive.\n\nHow can software be more like VIP? If we follow most innovation, it usually starts from a VIP experience. However, software is usually the opposite, where something went viral and attracted attention, and it grows from there.\n\nLook for experience that you liked, and find out where can you find the same experience but are 10 times more expensive. If you can deliver even more value in the 10 times more expensive setting, you might have a shot.",
    "timestamp": "2024-10-22T15:31:30.427Z"
  },
  {
    "id": "1729506420224",
    "content": "**15 words question and back of a business card business plan**\n\nCame across Don Valentine presentation in Stanford Business School back in 2010, these are the points that stuck with me:\n\n- If you ask a question, make it under 15 words, which means you have to think very hard about what you are actually asking\n- Write your business plan in the back of your business card\n- Money flows with a story\n\nSource:\n[Don Valentine, Sequoia Capital: \"Target Big Markets\"](https://www.youtube.com/watch?v=nKN-abRJMEw)",
    "timestamp": "2024-10-21T10:27:00.224Z"
  },
  {
    "id": "1729451210088",
    "content": "**A physical GitHub**\n\nIKEA is probably the only brands on earth that always has something in everyone's home. I remember I saw almost a dozen IKEA drying racks in the balcony of the whole building.\n\nBut people wanted to feel special and represent themselves. This where the IKEA hack comes in that turn IKEA products around. A shelf and be turned into a stool, a stool can be turned into a side table.\n\nThis reminds me of the template code that we modify it into our own versions. You put different pieces of open source together, then you would have an new app. Maybe IKEA is the physical version of this.\n\n",
    "timestamp": "2024-10-20T19:06:50.088Z"
  },
  {
    "id": "1729353183481",
    "content": "**Are LLMs like yet another phone now?**\n\nEvery week there is a new LLM released. We just can't keep up with it anymore. And that's why there is now benchmarks that helps you compare LLMs. \n\nHowever benchmarks reminds me of the smartphones back in 2009, where there are tons of benchmarks that compares phone's CPU on what they are capable of. I remember when I new phone launched, I would always look up the geekbench score to tell whether it's a good phone with a good CPU or not.\n\nFast forward to now, we care less about that now. When will we reach to a point that we don't care about LLMs benchmark anymore? What does the get the job done LLMs looks like?",
    "timestamp": "2024-10-19T15:53:03.481Z"
  },
  {
    "id": "1729238216234",
    "content": "**The safest software**\n\nI was a happy Arc user, their browser is really well thought out and has a lot of useful features. Yet recently it got hit by a serious security incident. The gist of it is that a feature called Boosts that lets you change fonts, colours and even add your own custom CSS or JavaScript ended up became a vulnerability. \n\nIt got fixed now, but it made me think what safety really is in the online world. We know that in the physical world, airplanes are the safest way to travel, but the extra effort that is needed to make it safe is very extreme, like from having two to three sets of pilots and crew members to the notorious security checks in the airport. Despite the hassle, it delivered the safety promise.\n\nHow can a software be truly safe with reasonable compromise on user experience? I got a lot more logins that are now requiring two factor authentication, and I have to say while it is annoying to put in the pin, that 10 seconds of finding the pin and put it in is a lot easier now. Maybe that is the standard of safety for now as baseline.",
    "timestamp": "2024-10-18T07:56:56.234Z"
  },
  {
    "id": "1729187532068",
    "content": "**Pricing is an interesting thing**\n\nWater has different prices in different places, free when you are next to a pond, and very expensive when you are in a theme park.\n\nSoftware was always free to many developers, but how can we create software more like water so that we can prove differently?\n\nSomething to think about before you write that line of code.",
    "timestamp": "2024-10-17T17:52:12.068Z"
  },
  {
    "id": "1729073147206",
    "content": "**Remote work is like long distance relationship**\n\nAmazon and Spotify couldn't be more different. One has mandated that employees return to the office five days a week while the other one maintains a flexible work-from-anywhere policy, allowing employees to choose their work environment and only requiring in-person meetings for one week each year. \n\nWho will win? I will bet on Spotify.\n\n",
    "timestamp": "2024-10-16T10:05:47.206Z"
  },
  {
    "id": "1728999851775",
    "content": "Hello world",
    "timestamp": "2024-10-15T13:44:11.775Z"
  }
]