[
  {
    "id": "1729238216234",
    "content": "The safest software\n\nI was a happy Arc user, their browser is really well thought out and has a lot of useful features. Yet recently it got hit by a serious security incident. The gist of it is that a feature called Boosts that lets you change fonts, colours and even add your own custom CSS or JavaScript ended up became a vulnerability. \n\nIt got fixed now, but it made me think what safety really is in the online world. We know that in the physical world, airplanes are the safest way to travel, but the extra effort that is needed to make it safe is very extreme, like from having two to three sets of pilots and crew members to the notorious security checks in the airport. Despite the hassle, it delivered the safety promise.\n\nHow can a software be truly safe with reasonable compromise on user experience? I got a lot more logins that are now requiring two factor authentication, and I have to say while it is annoying to put in the pin, that 10 seconds of finding the pin and put it in is a lot easier now. Maybe that is the standard of safety for now as baseline.",
    "timestamp": "2024-10-18T07:56:56.234Z"
  },
  {
    "id": "1729187532068",
    "content": "**Pricing is an interesting thing**\n\nWater has different prices in different places, free when you are next to a pond, and very expensive when you are in a theme park.\n\nSoftware was always free to many developers, but how can we create software more like water so that we can prove differently?\n\nSomething to think about before you write that line of code.",
    "timestamp": "2024-10-17T17:52:12.068Z"
  },
  {
    "id": "1729073147206",
    "content": "Remote work is like long distance relationship\n\nAmazon and Spotify couldn't be more different. One has mandated that employees return to the office five days a week while the other one maintains a flexible work-from-anywhere policy, allowing employees to choose their work environment and only requiring in-person meetings for one week each year. \n\nWho will win? I will bet on Spotify.\n\n",
    "timestamp": "2024-10-16T10:05:47.206Z"
  },
  {
    "id": "1728999851775",
    "content": "Hello world",
    "timestamp": "2024-10-15T13:44:11.775Z"
  }
]